; domain
(define (domain floods)
  (:requirements :typing)
  (:types uav ugv usv - robot box cdm store disaster area robot - object)
  (:predicates (anon-have_water_sample-ugv3 ?r - usv ?a - area)
   (anon-box_at-ugv3 ?b - box) (anon-have_picture-ugv3 ?d - disaster)
   (anon-store_of-ugv3 ?s - store) (anon-at-ugv3 ?a - area)
   (in_range ?area - area ?area - area)
   (communicated_data ?disaster - disaster)
   (have_water_sample_cdm ?cdm - cdm ?area - area) (full ?store - store)
   (empty ?store - store) (visible_from ?disaster - disaster ?area - area)
   (ground_path ?area - area ?area - area)
   (water_path ?area - area ?area - area) (box_at_area ?box - box ?area - area)
   (box_at_cdm ?box - box ?cdm - cdm) (cdm_at ?cdm - cdm ?area - area)
   (anon-have_water_sample-uav2 ?r - usv ?a - area)
   (anon-box_at-uav2 ?b - box ?r - ugv) (anon-have_picture-uav2 ?d - disaster)
   (anon-store_of-uav2 ?s - store) (anon-at-uav2 ?a - area)
   (anon-have_water_sample-ugv1 ?r - usv ?a - area) (anon-box_at-ugv1 ?b - box)
   (anon-have_picture-ugv1 ?d - disaster) (anon-store_of-ugv1 ?s - store)
   (anon-at-ugv1 ?a - area) (anon-have_water_sample-usv3 ?a - area)
   (anon-box_at-usv3 ?b - box ?r - ugv) (anon-have_picture-usv3 ?d - disaster)
   (anon-store_of-usv3 ?s - store) (anon-at-usv3 ?a - area)
   (anon-at-usv2 ?a - area) (anon-store_of-usv2 ?s - store)
   (anon-have_picture-usv2 ?d - disaster) (anon-box_at-usv2 ?b - box ?r - ugv)
   (anon-have_water_sample-usv2 ?a - area))

  (:action anon-communicate_data-uav2 :parameters
   (?c - cdm ?d - disaster ?a1 - area ?a2 - area) :precondition
   (and (anon-at-uav2 ?a1) (cdm_at ?c ?a2) (anon-have_picture-uav2 ?d)
        (in_range ?a1 ?a2))
   :effect (and (not (anon-have_picture-uav2 ?d)) (communicated_data ?d)))

  (:action anon-take_picture-uav2 :parameters (?a - area ?d - disaster)
   :precondition (and (visible_from ?d ?a) (anon-at-uav2 ?a)) :effect
   (and (anon-have_picture-uav2 ?d)))

  (:action anon-navigate_uav-uav2 :parameters (?a1 - area ?a2 - area)
   :precondition (and (anon-at-uav2 ?a1)) :effect
   (and (not (anon-at-uav2 ?a1)) (anon-at-uav2 ?a2)))

  (:action anon-communicate_data-usv3 :parameters
   (?c - cdm ?d - disaster ?a1 - area ?a2 - area) :precondition
   (and (anon-at-usv3 ?a1) (cdm_at ?c ?a2) (anon-have_picture-usv3 ?d)
        (in_range ?a1 ?a2))
   :effect (and (not (anon-have_picture-usv3 ?d)) (communicated_data ?d)))

  (:action anon-drop_sample-usv3 :parameters
   (?s - store ?a1 - area ?a2 - area ?c - cdm) :precondition
   (and (anon-store_of-usv3 ?s) (anon-have_water_sample-usv3 ?a2)
        (cdm_at ?c ?a1) (anon-at-usv3 ?a1))
   :effect
   (and (not (full ?s)) (not (anon-have_water_sample-usv3 ?a2))
        (have_water_sample_cdm ?c ?a2) (empty ?s)))

  (:action anon-sample_water-usv3 :parameters (?s - store ?a - area)
   :precondition (and (anon-at-usv3 ?a) (anon-store_of-usv3 ?s) (empty ?s))
   :effect (and (not (empty ?s)) (anon-have_water_sample-usv3 ?a) (full ?s)))

  (:action anon-take_picture-usv3 :parameters (?a - area ?d - disaster)
   :precondition (and (visible_from ?d ?a) (anon-at-usv3 ?a)) :effect
   (and (anon-have_picture-usv3 ?d)))

  (:action anon-navigate_usv-usv3 :parameters (?a1 - area ?a2 - area)
   :precondition (and (anon-at-usv3 ?a1) (water_path ?a1 ?a2)) :effect
   (and (not (anon-at-usv3 ?a1)) (anon-at-usv3 ?a2)))

  (:action anon-navigate_usv-usv2 :parameters (?a1 - area ?a2 - area)
   :precondition (and (anon-at-usv2 ?a1) (water_path ?a1 ?a2)) :effect
   (and (not (anon-at-usv2 ?a1)) (anon-at-usv2 ?a2)))

  (:action anon-take_picture-usv2 :parameters (?a - area ?d - disaster)
   :precondition (and (visible_from ?d ?a) (anon-at-usv2 ?a)) :effect
   (and (anon-have_picture-usv2 ?d)))

  (:action anon-sample_water-usv2 :parameters (?s - store ?a - area)
   :precondition (and (anon-at-usv2 ?a) (anon-store_of-usv2 ?s) (empty ?s))
   :effect (and (not (empty ?s)) (full ?s) (anon-have_water_sample-usv2 ?a)))

  (:action anon-drop_sample-usv2 :parameters
   (?s - store ?a1 - area ?a2 - area ?c - cdm) :precondition
   (and (anon-store_of-usv2 ?s) (anon-have_water_sample-usv2 ?a2)
        (cdm_at ?c ?a1) (anon-at-usv2 ?a1))
   :effect
   (and (not (full ?s)) (not (anon-have_water_sample-usv2 ?a2)) (empty ?s)
        (have_water_sample_cdm ?c ?a2)))

  (:action anon-communicate_data-usv2 :parameters
   (?c - cdm ?d - disaster ?a1 - area ?a2 - area) :precondition
   (and (anon-at-usv2 ?a1) (cdm_at ?c ?a2) (anon-have_picture-usv2 ?d)
        (in_range ?a1 ?a2))
   :effect (and (not (anon-have_picture-usv2 ?d)) (communicated_data ?d)))

  (:action anon-navigate_ugv-ugv1 :parameters (?a1 - area ?a2 - area)
   :precondition (and (anon-at-ugv1 ?a1) (ground_path ?a1 ?a2)) :effect
   (and (not (anon-at-ugv1 ?a1)) (anon-at-ugv1 ?a2)))

  (:action anon-take_picture-ugv1 :parameters (?a - area ?d - disaster)
   :precondition (and (visible_from ?d ?a) (anon-at-ugv1 ?a)) :effect
   (and (anon-have_picture-ugv1 ?d)))

  (:action anon-pickup_box-ugv1 :parameters
   (?s - store ?c - cdm ?a - area ?b - box) :precondition
   (and (box_at_cdm ?b ?c) (cdm_at ?c ?a) (anon-at-ugv1 ?a)
        (anon-store_of-ugv1 ?s) (empty ?s))
   :effect
   (and (not (empty ?s)) (not (box_at_cdm ?b ?c)) (anon-box_at-ugv1 ?b)
        (full ?s)))

  (:action anon-drop_box-ugv1 :parameters (?s - store ?a - area ?b - box)
   :precondition
   (and (anon-box_at-ugv1 ?b) (anon-store_of-ugv1 ?s) (anon-at-ugv1 ?a))
   :effect
   (and (not (full ?s)) (not (anon-box_at-ugv1 ?b)) (box_at_area ?b ?a)
        (empty ?s)))

  (:action anon-communicate_data-ugv1 :parameters
   (?c - cdm ?d - disaster ?a1 - area ?a2 - area) :precondition
   (and (anon-at-ugv1 ?a1) (cdm_at ?c ?a2) (anon-have_picture-ugv1 ?d)
        (in_range ?a1 ?a2))
   :effect (and (not (anon-have_picture-ugv1 ?d)) (communicated_data ?d)))

  (:action anon-navigate_ugv-ugv3 :parameters (?a1 - area ?a2 - area)
   :precondition (and (anon-at-ugv3 ?a1) (ground_path ?a1 ?a2)) :effect
   (and (not (anon-at-ugv3 ?a1)) (anon-at-ugv3 ?a2)))

  (:action anon-take_picture-ugv3 :parameters (?a - area ?d - disaster)
   :precondition (and (visible_from ?d ?a) (anon-at-ugv3 ?a)) :effect
   (and (anon-have_picture-ugv3 ?d)))

  (:action anon-pickup_box-ugv3 :parameters
   (?s - store ?c - cdm ?a - area ?b - box) :precondition
   (and (box_at_cdm ?b ?c) (cdm_at ?c ?a) (anon-at-ugv3 ?a)
        (anon-store_of-ugv3 ?s) (empty ?s))
   :effect
   (and (not (empty ?s)) (not (box_at_cdm ?b ?c)) (anon-box_at-ugv3 ?b)
        (full ?s)))

  (:action anon-drop_box-ugv3 :parameters (?s - store ?a - area ?b - box)
   :precondition
   (and (anon-box_at-ugv3 ?b) (anon-store_of-ugv3 ?s) (anon-at-ugv3 ?a))
   :effect
   (and (not (full ?s)) (not (anon-box_at-ugv3 ?b)) (box_at_area ?b ?a)
        (empty ?s)))

  (:action anon-communicate_data-ugv3 :parameters
   (?c - cdm ?d - disaster ?a1 - area ?a2 - area) :precondition
   (and (anon-at-ugv3 ?a1) (cdm_at ?c ?a2) (anon-have_picture-ugv3 ?d)
        (in_range ?a1 ?a2))
   :effect (and (not (anon-have_picture-ugv3 ?d)) (communicated_data ?d)))
)

; problem
(define (problem obfuscated-codmap-problem-usv2) (:domain floods)
  (:objects box2 box1 - box
             disaster5 disaster4 disaster3 disaster2 disaster1 - disaster
             area15 area14 area13 area12 area11 area10 area9 area8 area7 area6 area5 area4 area3 area2 area1 - area
             usv3store usv2store usv1store ugv3store ugv2store ugv1store - store
             cdm2 cdm1 - cdm
            )
  (:init
       (anon-at-uav2 area1)
       (anon-at-usv3 area13)
       (anon-store_of-usv3 usv3store)
       (anon-store_of-usv2 usv2store)
       (anon-at-usv2 area1)
       (anon-store_of-ugv1 ugv1store)
       (anon-at-ugv1 area1)
       (anon-store_of-ugv3 ugv3store)
       (empty ugv1store)
       (empty ugv2store)
       (empty ugv3store)
       (empty usv1store)
       (empty usv2store)
       (empty usv3store)
       (cdm_at cdm1 area1)
       (cdm_at cdm2 area13)
       (anon-at-ugv3 area13)
       (box_at_cdm box1 cdm1)
       (box_at_cdm box2 cdm2)
       (water_path area1 area2)
       (water_path area2 area1)
       (water_path area2 area4)
       (water_path area4 area2)
       (water_path area2 area6)
       (water_path area6 area2)
       (water_path area4 area5)
       (water_path area5 area4)
       (water_path area4 area9)
       (water_path area9 area4)
       (water_path area9 area8)
       (water_path area8 area9)
       (water_path area8 area7)
       (water_path area7 area8)
       (water_path area6 area12)
       (water_path area12 area6)
       (water_path area12 area10)
       (water_path area10 area12)
       (water_path area9 area13)
       (water_path area13 area9)
       (water_path area2 area14)
       (water_path area14 area2)
       (ground_path area1 area3)
       (ground_path area3 area1)
       (ground_path area3 area4)
       (ground_path area4 area3)
       (ground_path area3 area5)
       (ground_path area5 area3)
       (ground_path area4 area6)
       (ground_path area6 area4)
       (ground_path area4 area10)
       (ground_path area10 area4)
       (ground_path area10 area7)
       (ground_path area7 area10)
       (ground_path area7 area8)
       (ground_path area8 area7)
       (ground_path area5 area11)
       (ground_path area11 area5)
       (ground_path area11 area9)
       (ground_path area9 area11)
       (ground_path area10 area13)
       (ground_path area13 area10)
       (ground_path area3 area15)
       (ground_path area15 area3)
       (visible_from disaster1 area8)
       (visible_from disaster2 area12)
       (visible_from disaster3 area10)
       (visible_from disaster4 area7)
       (visible_from disaster5 area3)
       (in_range area2 area1)
       (in_range area3 area1)
       (in_range area1 area1)
       (in_range area9 area13)
       (in_range area10 area13)
       (in_range area13 area13))
  (:goal (and 
           (have_water_sample_cdm cdm1 area9)
           (have_water_sample_cdm cdm2 area8)
           (box_at_area box2 area11)
           (box_at_area box1 area9)
           (communicated_data disaster5)
           (communicated_data disaster4)
           (communicated_data disaster3)
           (communicated_data disaster2)
           (communicated_data disaster1))))

; plan
1. (anon-navigate_uav-uav2 area1 area3)
   deleted: (anon-at-uav2 area1)
   added: (anon-at-uav2 area3)
   goals met: 0 of 9
2. (anon-take_picture-uav2 area3 disaster5)
   added: (anon-have_picture-uav2 disaster5)
   goals met: 0 of 9
3. (anon-communicate_data-uav2 cdm1 disaster5 area3 area1)
   deleted: (anon-have_picture-uav2 disaster5)
   added: (communicated_data disaster5)
   goals met: 1 of 9
4. (anon-navigate_uav-uav2 area3 area7)
   deleted: (anon-at-uav2 area3)
   added: (anon-at-uav2 area7)
   goals met: 1 of 9
5. (anon-take_picture-uav2 area7 disaster4)
   added: (anon-have_picture-uav2 disaster4)
   goals met: 1 of 9
6. (anon-navigate_uav-uav2 area7 area9)
   deleted: (anon-at-uav2 area7)
   added: (anon-at-uav2 area9)
   goals met: 1 of 9
7. (anon-communicate_data-uav2 cdm2 disaster4 area9 area13)
   deleted: (anon-have_picture-uav2 disaster4)
   added: (communicated_data disaster4)
   goals met: 2 of 9
8. (anon-navigate_uav-uav2 area9 area10)
   deleted: (anon-at-uav2 area9)
   added: (anon-at-uav2 area10)
   goals met: 2 of 9
9. (anon-take_picture-uav2 area10 disaster3)
   added: (anon-have_picture-uav2 disaster3)
   goals met: 2 of 9
10. (anon-communicate_data-uav2 cdm2 disaster3 area10 area13)
   deleted: (anon-have_picture-uav2 disaster3)
   added: (communicated_data disaster3)
   goals met: 3 of 9
11. (anon-navigate_uav-uav2 area10 area12)
   deleted: (anon-at-uav2 area10)
   added: (anon-at-uav2 area12)
   goals met: 3 of 9
12. (anon-take_picture-uav2 area12 disaster2)
   added: (anon-have_picture-uav2 disaster2)
   goals met: 3 of 9
13. (anon-navigate_uav-uav2 area12 area9)
   deleted: (anon-at-uav2 area12)
   added: (anon-at-uav2 area9)
   goals met: 3 of 9
14. (anon-communicate_data-uav2 cdm2 disaster2 area9 area13)
   deleted: (anon-have_picture-uav2 disaster2)
   added: (communicated_data disaster2)
   goals met: 4 of 9
15. (anon-navigate_uav-uav2 area9 area8)
   deleted: (anon-at-uav2 area9)
   added: (anon-at-uav2 area8)
   goals met: 4 of 9
16. (anon-take_picture-uav2 area8 disaster1)
   added: (anon-have_picture-uav2 disaster1)
   goals met: 4 of 9
17. (anon-navigate_uav-uav2 area8 area9)
   deleted: (anon-at-uav2 area8)
   added: (anon-at-uav2 area9)
   goals met: 4 of 9
18. (anon-communicate_data-uav2 cdm2 disaster1 area9 area13)
   deleted: (anon-have_picture-uav2 disaster1)
   added: (communicated_data disaster1)
   goals met: 5 of 9
19. (anon-navigate_usv-usv3 area13 area9)
   deleted: (anon-at-usv3 area13)
   added: (anon-at-usv3 area9)
   goals met: 5 of 9
20. (anon-navigate_usv-usv3 area9 area8)
   deleted: (anon-at-usv3 area9)
   added: (anon-at-usv3 area8)
   goals met: 5 of 9
21. (anon-sample_water-usv3 usv3store area8)
   deleted: (empty usv3store)
   added: (anon-have_water_sample-usv3 area8) (full usv3store)
   goals met: 5 of 9
22. (anon-navigate_usv-usv3 area8 area9)
   deleted: (anon-at-usv3 area8)
   added: (anon-at-usv3 area9)
   goals met: 5 of 9
23. (anon-navigate_usv-usv3 area9 area13)
   deleted: (anon-at-usv3 area9)
   added: (anon-at-usv3 area13)
   goals met: 5 of 9
24. (anon-drop_sample-usv3 usv3store area13 area8 cdm2)
   deleted: (full usv3store) (anon-have_water_sample-usv3 area8)
   added: (have_water_sample_cdm cdm2 area8) (empty usv3store)
   goals met: 6 of 9
25. (anon-navigate_usv-usv2 area1 area2)
   deleted: (anon-at-usv2 area1)
   added: (anon-at-usv2 area2)
   goals met: 6 of 9
26. (anon-navigate_usv-usv2 area2 area4)
   deleted: (anon-at-usv2 area2)
   added: (anon-at-usv2 area4)
   goals met: 6 of 9
27. (anon-navigate_usv-usv2 area4 area9)
   deleted: (anon-at-usv2 area4)
   added: (anon-at-usv2 area9)
   goals met: 6 of 9
28. (anon-sample_water-usv2 usv2store area9)
   deleted: (empty usv2store)
   added: (full usv2store) (anon-have_water_sample-usv2 area9)
   goals met: 6 of 9
29. (anon-navigate_usv-usv2 area9 area4)
   deleted: (anon-at-usv2 area9)
   added: (anon-at-usv2 area4)
   goals met: 6 of 9
30. (anon-navigate_usv-usv2 area4 area2)
   deleted: (anon-at-usv2 area4)
   added: (anon-at-usv2 area2)
   goals met: 6 of 9
31. (anon-navigate_usv-usv2 area2 area1)
   deleted: (anon-at-usv2 area2)
   added: (anon-at-usv2 area1)
   goals met: 6 of 9
32. (anon-drop_sample-usv2 usv2store area1 area9 cdm1)
   deleted: (full usv2store) (anon-have_water_sample-usv2 area9)
   added: (empty usv2store) (have_water_sample_cdm cdm1 area9)
   goals met: 7 of 9
33. (anon-pickup_box-ugv1 ugv1store cdm1 area1 box1)
   deleted: (empty ugv1store) (box_at_cdm box1 cdm1)
   added: (anon-box_at-ugv1 box1) (full ugv1store)
   goals met: 7 of 9
34. (anon-navigate_ugv-ugv1 area1 area3)
   deleted: (anon-at-ugv1 area1)
   added: (anon-at-ugv1 area3)
   goals met: 7 of 9
35. (anon-navigate_ugv-ugv1 area3 area5)
   deleted: (anon-at-ugv1 area3)
   added: (anon-at-ugv1 area5)
   goals met: 7 of 9
36. (anon-navigate_ugv-ugv1 area5 area11)
   deleted: (anon-at-ugv1 area5)
   added: (anon-at-ugv1 area11)
   goals met: 7 of 9
37. (anon-navigate_ugv-ugv1 area11 area9)
   deleted: (anon-at-ugv1 area11)
   added: (anon-at-ugv1 area9)
   goals met: 7 of 9
38. (anon-drop_box-ugv1 ugv1store area9 box1)
   deleted: (full ugv1store) (anon-box_at-ugv1 box1)
   added: (box_at_area box1 area9) (empty ugv1store)
   goals met: 8 of 9
39. (anon-pickup_box-ugv3 ugv3store cdm2 area13 box2)
   deleted: (empty ugv3store) (box_at_cdm box2 cdm2)
   added: (anon-box_at-ugv3 box2) (full ugv3store)
   goals met: 8 of 9
40. (anon-navigate_ugv-ugv3 area13 area10)
   deleted: (anon-at-ugv3 area13)
   added: (anon-at-ugv3 area10)
   goals met: 8 of 9
41. (anon-navigate_ugv-ugv3 area10 area4)
   deleted: (anon-at-ugv3 area10)
   added: (anon-at-ugv3 area4)
   goals met: 8 of 9
42. (anon-navigate_ugv-ugv3 area4 area3)
   deleted: (anon-at-ugv3 area4)
   added: (anon-at-ugv3 area3)
   goals met: 8 of 9
43. (anon-navigate_ugv-ugv3 area3 area5)
   deleted: (anon-at-ugv3 area3)
   added: (anon-at-ugv3 area5)
   goals met: 8 of 9
44. (anon-navigate_ugv-ugv3 area5 area11)
   deleted: (anon-at-ugv3 area5)
   added: (anon-at-ugv3 area11)
   goals met: 8 of 9
45. (anon-drop_box-ugv3 ugv3store area11 box2)
   deleted: (full ugv3store) (anon-box_at-ugv3 box2)
   added: (box_at_area box2 area11) (empty ugv3store)
   goals met: 9 of 9
